BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
          while (true) { // read and process incomming data in a loop 
            char c = recvTelnetChar ();
            switch (c) {
                case 0:   return 0; // Error
                case 3:   return 3; // Ctrl-C
                case 4:             // EOF - Ctrl-D (UNIX)
                case 26:  return 4; // EOF - Ctrl-Z (Windows)
                case 8:   // backspace - delete last character from the buffer and from the screen
                case 127: // in Windows telent.exe this is del key, but putty reports backspace with code 127, so let's treat it the same way as backspace
                          if (characters && buf [characters - 1] >= ' ') {
                            buf [-- characters] = 0;
                            if (__echo__ && sendTelnet ((char *) "\x08 \x08") <= 0) return 0; // delete the last character from the screen
                          }
                          break;                            
                case 10:  // LF
                          if (trim) {
                            while (buf [0] == ' ') strcpy (buf, buf + 1); // ltrim
                            int i; for (i = 0; buf [i] > ' '; i++); buf [i] = 0; // rtrim
                          }
                          if (__echo__ && sendTelnet ((char *) "\r\n") <= 0) return 0; // echo CRLF to the screen
                          return 10;
                case 13:  // CR
                          break; // ignore 
                case 9:   // tab - treat as 2 spaces
                          c = ' ';
                          if (characters < len - 1) {
                            buf [characters] = c; buf [++ characters] = 0;
                            if (__echo__ && sendTelnet (&c, sizeof (c)) <= 0) return 0; // echo last character to the screen
                          }                
                          // continue with default (repeat adding a space):
                default:  // fill the buffer 
                          if (characters < len - 1) {
                            buf [characters] = c; buf [++ characters] = 0;
                            if (__echo__ && sendTelnet (&c, sizeof (c)) <= 0) return 0; // echo last character to the screen
                          }
                          break;              
            } // switch
          } // while
          return 0;
        }
        
      private:

        STATE_TYPE __state__ = NOT_RUNNING;

        unsigned long __lastActive__ = millis (); // time-out detection        

        unsigned long __telnet_connection_time_out__ = TELNET_CONNECTION_TIME_OUT;
      
        int __connectionSocket__ = -1;
        String (*__telnetCommandHandlerCallback__) (int argc, char *argv [], telnetConnection *tcn) = NULL;
        char __clientIP__ [46] = "";
        char __serverIP__ [46] = "";

        char __peekedOnlyChar__ = 0;
        char __cmdLine__ [TELNET_CMDLINE_BUFFER_SIZE]; // characters cleared of IAC commands, 1 line at a time

        // telnet session related variables
        char __userName__ [USER_PASSWORD_MAX_LENGTH + 1] = "";
        #ifdef __FILE_SYSTEM__
          char __homeDir__ [FILE_PATH_MAX_LENGTH + 1] = "";
          char __workingDir__ [FILE_PATH_MAX_LENGTH + 1] = "";
        #endif
        char __prompt__ = 0;
        uint16_t __clientWindowWidth__ = 0;
        uint16_t __clientWindowHeight__ = 0;

        bool __echo__ = true;
        
        static void __connectionTask__ (void *pvParameters) {
          // get "this" pointer
          telnetConnection *ths = (telnetConnection *) pvParameters;           
          { // code block
            { // login procedure
              #if USER_MANAGEMENT == NO_USER_MANAGEMENT
                // prepare session defaults
                strcpy (ths->__userName__, "root");
                #ifdef __FILE_SYSTEM__
                    userManagement.getHomeDirectory (ths->__homeDir__, sizeof (ths->__homeDir__), ths->__userName__);
                    strcpy (ths->__workingDir__, ths->__homeDir__);
                #endif
                ths->__prompt__ = '#';
                dmesg ("[telnetConnection] user logged in: ", ths->__userName__);
                // tell the client to go into character mode, not to echo and send its window size, then say hello 
                sprintf (ths->__cmdLine__, IAC WILL ECHO IAC WILL SUPPRESS_GO_AHEAD IAC DO NAWS HOSTNAME " says hello to %s.\r\nWelcome %s, use \"help\" to display available commands.\r\n\n", ths->__clientIP__, ths->__userName__);
                if (ths->sendTelnet (ths->__cmdLine__) <= 0) goto endOfConnection;
                *ths->__cmdLine__ = 0;
              #else
                // tell the client to go into character mode, not to echo an send its window size, then say hello 
                sprintf (ths->__cmdLine__, IAC WILL ECHO IAC WILL SUPPRESS_GO_AHEAD IAC DO NAWS HOSTNAME " says hello to %s, please login.\r\nuser: ", ths->__clientIP__);
                if (ths->sendTelnet (ths->__cmdLine__) <= 0) {
                  dmesg ("[telnetConnection] send error: ", errno, strerror (errno));
                  goto endOfConnection;
                }
                if (ths->recvTelnetLine (ths->__userName__, sizeof (ths->__userName__)) != 10) { 
                  goto endOfConnection;                
                }
                // if (!ths->__userName__ [0]) endOfConnection;
                char password [USER_PASSWORD_MAX_LENGTH + 1] = "";
                ths->__echo__ = false;
                if (ths->sendTelnet ((char *) "password: ") <= 0) goto endOfConnection;
                if (ths->recvTelnetLine (password, sizeof (password)) != 10) { 
                  goto endOfConnection;                
                }
                // if (!ths->__password__ [0]) endOfConnection;
                ths->__echo__ = true;
                // check user name and password
                if (!userManagement.checkUserNameAndPassword (ths->__userName__, password)) { 
                  dmesg ("[telnetConnection] user failed to login: ", ths->__userName__);
                  delay (100);
                  ths->sendTelnet ((char *) "\r\nUsername and/or password incorrect.");
                  goto endOfConnection;                                
                }
                dmesg ("[telnetConnection] user logged in: ", ths->__userName__);
                // prepare session defaults
                #ifdef __FILE_SYSTEM__
                    userManagement.getHomeDirectory (ths->__homeDir__, sizeof (ths->__homeDir__), ths->__userName__);
                    strcpy (ths->__workingDir__, ths->__homeDir__);
                #endif
                ths->__prompt__ = strcmp (ths->__userName__, "root") ? '$' : '#';
                sprintf (ths->__cmdLine__, "\r\nWelcome %s, use \"help\" to display available commands.\r\n\n", ths->__userName__);
                if (ths->sendTelnet (ths->__cmdLine__) <= 0) goto endOfConnection;
                *ths->__cmdLine__ = 0;
              #endif
            } // login procedure
            // this is where telnet session really starts
            while (true) { // endless loop of reading and executing commands
              
                // write prompt and possibly \r\n
                sprintf (ths->__cmdLine__ + strlen (ths->__cmdLine__), "%c ", ths->__prompt__);
                if (ths->sendTelnet (ths->__cmdLine__) <= 0) goto endOfConnection;
                // read command line
                switch (ths->recvTelnetLine (ths->__cmdLine__, sizeof (ths->__cmdLine__), false)) {
                  case 3:   { // Ctrl-C, end the connection
                              ths->sendTelnet ((char *) "\r\nCtrl-C");
                              goto endOfConnection;
                            }
                  case 10:  { // Enter, parse command line

                              // DEBUG: Serial.printf ("cmdline = %s\n", ths->__cmdLine__); Serial.println ("-----------");
                              int argc = 0;
                              char *argv [TELNET_SESSION_MAX_ARGC];
  
                              char *q = ths->__cmdLine__ - 1;
                              while (true) {
                                char *p = q + 1; while (*p && *p <= ' ') p++;
                                if (*p) { // p points to the beginning of an argument
                                  bool quotation = false;
                                  if (*p == '\"') { quotation = true; p++; }
                                  argv [argc++] = p;
                                  q = p; 
                                  while (*q && (*q > ' ' || quotation)) if (*q == '\"') break; else q++; // q points after the end of an argument 
                                  if (*q) *q = 0; else break;
                                } else break;
                                if (argc == TELNET_SESSION_MAX_ARGC) break;
                              }
                              // DEBUG: Serial.printf ("argc = %i\n", argc); for (int i = 0; i < argc; i++) Serial.printf ("argv [%i] = '%s'\n", i, argv [i]); Serial.println ("-----------");

                              // process commandLine
                              if (argc) {
                                // ask telnetCommandHandler (if it is provided by the calling program) if it is going to handle this command, otherwise try to handle it internally
                                String s;
                                if (ths->__telnetCommandHandlerCallback__) s = ths->__telnetCommandHandlerCallback__ (argc, argv, ths);
                                if (!s) { // out of memory                               
                                  if (ths->sendTelnet ((char *) "Out of memory") <= 0) goto endOfConnection;
                                } else if (s != "") { // __telnetCommandHandlerCallback__ returned a reply                
                                  if (ths->sendTelnet ((char *) s.c_str ()) <= 0) goto endOfConnection;
                                } else { // // __telnetCommandHandlerCallback__ returned "" - handle the command internally
                                  string s = ths->internalTelnetCommandHandler (argc, argv, ths);
                                  if (ths->__connectionSocket__ == -1) goto endOfConnection; // in case of quit - quit command closes the socket itself
                                  if (s != "") if (ths->sendTelnet (s) <= 0) goto endOfConnection;                               
                                }
                                sprintf (ths->__cmdLine__, "\r\n"); // will be sent to client together with promtp sign  
                              } else {
                                *ths->__cmdLine__ = 0; // prepare buffer for the next user input                           
                              }
                              // DEBUG: Serial.printf ("[telnetConnection] stack high-water mark: %lu\n", uxTaskGetStackHighWaterMark (NULL));
                              break;
                            }
                  case 0:   {
                              if (errno == EAGAIN || errno == ENAVAIL) ths->sendTelnet ((char *) "\r\nTime-out");
                              goto endOfConnection;                
                            }
                  default:  // ignore
                            break;
                }
            
            } // endless loop of reading and executing commands

          } // code block
        endOfConnection:  
          if (ths->__prompt__) dmesg ("[telnetConnection] user logged out: ", ths->__userName__); // if prompt is set, we know that login was successful
          // all variables are freed now, unload the instance and stop the task (in this order)
          delete ths;
          vTaskDelete (NULL);                
        }

