BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
        string __uname__ () { return UNAME; }

        const char *__free__ (unsigned long delaySeconds, telnetConnection *tcn) {
            bool firstTime = true;
            int currentLine = 0;
            char s [100];
            do { // follow         
                if (firstTime || (tcn->getClientWindowHeight ()  && currentLine >= tcn->getClientWindowHeight ())) {
                    sprintf (s, "%sFree heap       Max free block\r\n------------------------------", firstTime ? "" : "\r\n");
                    if (sendTelnet (s) <= 0) return "";
                    currentLine = 2; // we have just displayed 2 lines (header)
                }
                if (!firstTime && delaySeconds) { // wait and check if user pressed a key
                    unsigned long startMillis = millis ();
                    while (millis () - startMillis < (delaySeconds * 1000)) {
                        delay (100);
                        if (tcn->recvTelnetChar (true)) {
                            tcn->recvTelnetChar (false); // read pending character
                            return ""; // return if user pressed Ctrl-C or any key
                        } 
                        if (tcn->connectionTimeOut ()) { sendTelnet ((char *) "\r\nTime-out"); tcn->closeConnection (); return ""; }
                    }
                }
                sprintf (s, "\r\n%10lu   %10lu  bytes", (unsigned long) ESP.getFreeHeap (), (unsigned long) heap_caps_get_largest_free_block (MALLOC_CAP_DEFAULT));
                if (sendTelnet (s) <= 0) return "";
                firstTime = false;
                currentLine ++; // we have just displayed the next line (data)
            } while (delaySeconds);
            return "";
        }

        const char *__netstat__ (unsigned long delaySeconds, telnetConnection *tcn) {
            // variables for delta calculation
            networkTrafficInformationType lastNetworkTrafficInformation = {}; 
            networkTrafficInformationType lastSocketTrafficInformation [MEMP_NUM_NETCONN] = {}; 

            char s [256];

            do {

                // clear screen
                if (delaySeconds) if (sendTelnet ((char *) "\x1b[2J") <= 0) return "";
                
                // display totals
                sprintf (s, "total bytes received and sent:                       %10lu      %10lu\r\n", networkTrafficInformation.bytesReceived - lastNetworkTrafficInformation.bytesReceived, networkTrafficInformation.bytesSent - lastNetworkTrafficInformation.bytesSent);

                // update variables for delta calculation
                lastNetworkTrafficInformation = networkTrafficInformation;

                if (sendTelnet (s) <= 0) return "";

                // display header
                sprintf (s, "\r\n"
                            "socket  local address      remote address        bytes received      bytes sent      inactive\r\n"
                            "---------------------------------------------------------------------------------------------------------------");
                if (sendTelnet (s) <= 0) return "";

                // scan through sockets
                for (int i = LWIP_SOCKET_OFFSET; i < LWIP_SOCKET_OFFSET + MEMP_NUM_NETCONN; i++) { // socket numbers are only within this range
                    char socketIP [46]; struct sockaddr_in socketAddress = {}; socklen_t len = sizeof (socketAddress);
                    // get server side address first
                    if (getsockname (i, (struct sockaddr *) &socketAddress, &len) != -1) {
                        inet_ntoa_r (socketAddress.sin_addr, socketIP, sizeof (socketIP));
                        sprintf (s, "\r\n  %2i    %s:%i                                                                       ", i, socketIP, ntohs (socketAddress.sin_port));
                        // get client side address next
                        if (getpeername (i, (struct sockaddr *) &socketAddress, &len) != -1) {
                            inet_ntoa_r (socketAddress.sin_addr, socketIP, sizeof (socketIP));
                            if (socketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesReceived < lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesReceived || socketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesSent < lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesSent) lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET] = {0, 0};
                            sprintf (s + 31, "%s:%i               ", socketIP, ntohs (socketAddress.sin_port));
                            sprintf (s + 57, "%8lu      %10lu      %6lu s  %s", socketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesReceived - lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesReceived, socketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesSent - lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesSent, (millis () - socketTrafficInformation [i - LWIP_SOCKET_OFFSET].lastActiveMillis) / 1000,  ((i == tcn->getSocket ()) ? "this connection" : ""));
                        } else { // socket without a peer address - it must be a listening socket
                            sprintf (s + 87, "%6lu s  listening socket", (millis () - socketTrafficInformation [i - LWIP_SOCKET_OFFSET].lastActiveMillis) / 1000);
                        }

                        // update variables for delta calculation
                        lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesReceived = socketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesReceived;
                        lastSocketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesSent = socketTrafficInformation [i - LWIP_SOCKET_OFFSET].bytesSent;

                        if (sendTelnet (s) <= 0) return "";
                    }
                }

                // wait for a key press
                unsigned long startMillis = millis ();
                while (millis () - startMillis < (delaySeconds * 1000)) {
                    delay (100);
                    if (tcn->recvTelnetChar (true)) {
                        tcn->recvTelnetChar (false); // read pending character
                        return ""; // return if user pressed Ctrl-C or any key
                    } 
                    if (tcn->connectionTimeOut ()) { sendTelnet ((char *) "\r\nTime-out"); tcn->closeConnection (); return ""; }
                }

