BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
        string __curl__ (char *method, char *url, telnetConnection *tcn) {
            char server [65];
            char addr [128] = "/";
            int port = 80;
            if (sscanf (url, "http://%64[^:]:%i/%126s", server, &port, addr + 1) < 2) { // we haven't got at least server, port and the default address
                if (sscanf (url, "http://%64[^/]/%126s", server, addr + 1) < 1) { // we haven't got at least server and the default address  
                    return "Wrong url, use form of http://server/address or http://server:port/address";
                }
            }
            if (port <= 0) return "Wrong port number, it should be > 0";
            String r = httpClient (server, port, addr, method);
            if (!r) return "Out of memory";
            sendTelnet ((char *) r.c_str ());
            return "";            
        }

      #endif

      #ifdef __FILE_SYSTEM__        

        bool telnetUserHasRightToAccessFile (char *fullPath) { return strstr (fullPath, __homeDir__) == fullPath; }
        bool telnetUserHasRightToAccessDirectory (char *fullPath) { return telnetUserHasRightToAccessFile (string (fullPath) + (char *) "/"); }
        
        #if (FILE_SYSTEM & FILE_SYSTEM_FAT) == FILE_SYSTEM_FAT
            const char *__mkfs__ (telnetConnection *tcn) {
                if (sendTelnet ((char *) "formatting FAT file system, please wait ... ") <= 0) return ""; 
                fileSystem.unmount ();
                if (fileSystem.formatFAT ()) {
                                                          return "formatted.";
                    if (fileSystem.mountFAT (false))      return "\r\nFAT file system mounted,\r\nreboot now to create default configuration files\r\nor you can create them yorself before rebooting.";
                    else                                  return "formatted but failed to mount the file system."; 
                } else                                    return "failed.";
                return "";
            }
        #endif

        #if (FILE_SYSTEM & FILE_SYSTEM_LITTLEFS) == FILE_SYSTEM_LITTLEFS
            const char *__mkfs__ (telnetConnection *tcn) {
                if (sendTelnet ((char *) "formatting LittleFs file system, please wait ... ") <= 0) return ""; 
                fileSystem.unmount ();
                if (fileSystem.formatLittleFs ()) {
                                                          return "formatted.";
                    if (fileSystem.mountLittleFs (false)) return "\r\nLittleFs file system mounted,\r\nreboot now to create default configuration files\r\nor you can create them yorself before rebooting.";
                    else                                  return "formatted but failed to mount the file system."; 
                } else                                    return "failed.";
                return "";
            }
        #endif
  
        string __fs_info__ () {
            if (!fileSystem.mounted ()) return "File system not mounted. You may have to format flash disk first.";
            string s = ""; // string = fsString<350> so we have enough space
            
            #if (FILE_SYSTEM & FILE_SYSTEM_FAT) == FILE_SYSTEM_FAT
                sprintf (s, "FAT file system --------------------\r\n"
                            "Total space:      %10lu K bytes\r\n"
                            "Total space used: %10lu K bytes\r\n"
                            "Free space:       %10lu K bytes\r\n",
                            FFat.totalBytes () / 1024, 
                            FFat.usedBytes () / 1024, 
                            (FFat.totalBytes () - FFat.usedBytes ()) / 1024
                      );
            #endif

            #if (FILE_SYSTEM & FILE_SYSTEM_LITTLEFS) == FILE_SYSTEM_LITTLEFS
                sprintf (s, "LittleFS file system:\r\n"
                            "Total space:      %10i K bytes\r\n"
                            "Total space used: %10i K bytes\r\n"
                            "Free space:       %10i K bytes\r\n",
                            LittleFS.totalBytes () / 1024, 
                            LittleFS.usedBytes () / 1024, 
                            (LittleFS.totalBytes () - LittleFS.usedBytes ()) / 1024
                      );
            #endif

            #if (FILE_SYSTEM & FILE_SYSTEM_SD_CARD) == FILE_SYSTEM_SD_CARD
                // if (sendTelnet ((char *) s) <= 0) return ""; 

                const char *cardTypeText = "unknown";
                uint8_t cardType = SD.cardType ();
                switch (cardType) {
                    case CARD_NONE: cardTypeText = "no SD card attached"; break;
                    case CARD_MMC:  cardTypeText = "MMC"; break;
                    case CARD_SD:   cardTypeText = "SDSC"; break;
                    case CARD_SDHC: cardTypeText = "SDHC"; break;
                }

                sprintf ((char *) s + strlen (s), "SD card ----------------------------\r\n"
                            "Type:   %20s\r\n",
                            cardTypeText
                      );
            #endif

            return s;
        } 

        const char *__diskstat__ (unsigned long delaySeconds, telnetConnection *tcn) {
            // variables for delta calculation
            diskTrafficInformationType lastDiskTrafficInformation = {}; 

            char s [256];

            // display header
            sprintf (s, "\r\n"
                        "bytes read   bytes written\r\n"
                        "--------------------------");
            if (sendTelnet (s) <= 0) return "";

            do {
                sprintf (s, "\r\n  %8lu        %8lu", diskTrafficInformation.bytesRead, diskTrafficInformation.bytesWritten);
                if (sendTelnet (s) <= 0) return "";

                // update variables for delta calculation
                lastDiskTrafficInformation = diskTrafficInformation;

                // wait for a key press
                unsigned long startMillis = millis ();
                while (millis () - startMillis < (delaySeconds * 1000)) {
                    delay (100);
                    if (tcn->recvTelnetChar (true)) {
                        tcn->recvTelnetChar (false); // read pending character
                        return ""; // return if user pressed Ctrl-C or any key
                    } 
                    if (tcn->connectionTimeOut ()) { sendTelnet ((char *) "\r\nTime-out"); tcn->closeConnection (); return ""; }
                }

