BojanJurca/Multitasking-Esp32-HTTP-FTP-Telnet-servers-for-Arduino/servers/telnetServer.hpp
            } while (delaySeconds);
            return "";
        }        
  
        string __ls__ (char *directoryName, telnetConnection *tcn) {
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            string fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "" || !fileSystem.isDirectory (fp))   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";

            // display information about files and subdirectories
            bool firstRecord = true;
            File d = fileSystem.open (fp); 
            if (!d) return "Out of resources";
            for (File f = d.openNextFile (); f; f = d.openNextFile ()) {
                string fullFileName = fp;
                if (fullFileName [fullFileName.length () - 1] != '/') fullFileName += '/'; fullFileName += f.name ();
                if (sendTelnet (firstRecord ? fileSystem.fileInformation (fullFileName) : string ("\r\n") + fileSystem.fileInformation (fullFileName)) <= 0) { d.close (); return "Out of memory"; }
                firstRecord = false;
            }
            d.close ();
            return "";            
        }
  
        // iteratively scan directory tree, recursion takes too much stack
        const char *__tree__ (char *directoryName, telnetConnection *tcn) {
            if (!fileSystem.mounted ())                     return "File system not mounted. You may have to format flash disk first.";
            string fp = fileSystem.makeFullPath (directoryName, __workingDir__);
            if (fp == "" || !fileSystem.isDirectory (fp))   return "Invalid directory name.";
            if (!telnetUserHasRightToAccessDirectory (fp))  return "Access denyed.";

            // keep directory names saved in vector for later recursion   
            vector<string> dirList (3); 
            if (dirList.push_back (fp) != dirList.OK) return "Out of memory";
            bool firstRecord = true;
            while (dirList.size () != 0) {

                // 1. take the first directory from dirList
                fp = dirList [0];
                dirList.erase (0);

                // 2. display directory info
                 if (sendTelnet (firstRecord ? fileSystem.fileInformation (fp, true) : string ("\r\n") + fileSystem.fileInformation (fp, true)) <= 0) return "Out of memory";
                 firstRecord = false;

                // 3. display information about files and remember subdirectories in dirList
                File d = fileSystem.open (fp); 
                if (!d) return "Out of resources";
                for (File f = d.openNextFile (); f; f = d.openNextFile ()) {
                    if (f.isDirectory ()) {
                        // save directory name for later recursion
                        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL (4, 4, 0) || FILE_SYSTEM == FILE_SYSTEM_LITTLEFS // f.name contains only a file name without path
                            string dp = fp; if (dp [dp.length () - 1] != '/') dp += '/'; dp += f.name ();                          
                            if (dirList.push_back (dp) != dirList.OK) { d.close (); return "Out of memory"; }
                        #else                                                                                       // f.name contains full file path
                            if (dirList.push_back (f.name ()) != dirList.OK) { d.close (); return "Out of memory"; }
                        #endif
                    } else {
                        #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL (4, 4, 0) || FILE_SYSTEM == FILE_SYSTEM_LITTLEFS // f.name contains only a file name without path
                            string dp = fp; if (dp [dp.length () - 1] != '/') dp += '/'; dp += f.name ();
                            if (sendTelnet (string ("\r\n") + fileSystem.fileInformation (dp, true)) <= 0) { d.close (); return "Out of memory"; }
                        #else                                                                                         // f.name contains full file path
                            if (sendTelnet (string ("\r\n") + fileSystem.fileInformation (f.name (), true)) <= 0) { d.close (); return "Out of memory"; }
                        #endif                              
                    }
                }
                d.close ();
            }
            return "";    
        }

        string __catFileToClient__ (char *fileName, telnetConnection *tcn) {
            if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";
            string fp = fileSystem.makeFullPath (fileName, __workingDir__);
            if (fp == "" || !fileSystem.isFile (fp))  return "Invalid file name.";
            if (!telnetUserHasRightToAccessFile (fp)) return "Access denyed.";

            char buff [1500]; // MTU = 1500 (maximum transmission unit), TCP_SND_BUF = 5744 (a maximum block size that ESP32 can send), FAT cluster size = n * 512. 1500 seems the best option
            *buff = 0;
            
            File f;
            if ((bool) (f = fileSystem.open (fp, "r", false))) {
                int i = strlen (buff);
                while (f.available ()) {
                    switch (*(buff + i) = f.read ()) {
                      case '\r':  // ignore
                                  break;
                      case '\n':  // LF-CRLF conversion
                                  *(buff + i ++) = '\r'; 
                                  *(buff + i ++) = '\n';
                                  break;
                      default:
                                  i ++;                  
                    }
                    if (i >= sizeof (buff) - 2) { 

                                                  diskTrafficInformation.bytesRead += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                                                  if (sendTelnet (buff, i) <= 0) { f.close (); return ""; }
                                                  i = 0; 
                                                }
                    }
                    if (i)                      { 

                                                    diskTrafficInformation.bytesRead += i; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                                                    if (sendTelnet (buff, i) <= 0) { f.close (); return ""; }
                                                }
              } else {
                  f.close (); return string ("Can't read ") + fp;
              }
              f.close ();
              return "";
        }

        string __catClientToFile__ (char *fileName, telnetConnection *tcn) {
          if (!fileSystem.mounted ())                   return "File system not mounted. You may have to format flash disk first.";
          string fp = fileSystem.makeFullPath (fileName, __workingDir__);
          if (fp == "" || fileSystem.isDirectory (fp))  return "Invalid file name.";
          if (!telnetUserHasRightToAccessFile (fp))     return "Access denyed.";

          File f;
          if ((bool) (f = fileSystem.open (fp, "w", true))) {
            while (char c = recvTelnetChar ()) { 
              switch (c) {
                case 0: // Error
                case 3: // Ctrl-C
                        f.close (); return fp + (char *) " not fully written.";
                case 4: // Ctrl-D or Ctrl-Z
                        f.close (); return string ("\r\n") + fp + (char *) " written.";
                case 13: // ignore
                        break;
                case 10: // LF -> CRLF conversion
                        if (f.write ((uint8_t *) "\r\n", 2) != 2) { 
                          f.close (); return string ("Can't write ") + fp;
                        } 

                        diskTrafficInformation.bytesWritten += 2; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                        // echo
                        if (sendTelnet ((char *) "\r\n") <= 0) return "";
                        break;
                default: // character 
                        if (f.write ((uint8_t *) &c, 1) != 1) { 
                          f.close (); return string ("Can't write ") + fp;
                        } 

                        diskTrafficInformation.bytesWritten += 1; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

                        // echo
                        if (sendTelnet (&c, 1) <= 0) return "";
                        break;
              }
            }
            f.close ();
          } else {
            return string ("Can't write ") + fp;
          }
          return "";
        }

        string __tail__ (char *fileName, bool follow, telnetConnection *tcn) {
            if (!fileSystem.mounted ())               return "File system not mounted. You may have to format flash disk first.";
            string fp = fileSystem.makeFullPath (fileName, __workingDir__);
            if (fp == "" || !fileSystem.isFile (fp))  return "Invalid file name.";
            if (!telnetUserHasRightToAccessFile (fp)) return "Access denyed.";

            File f;
            size_t filePosition = 0;
            do {
                if ((bool) (f = fileSystem.open (fp, "r", false))) {
                    // if this is the first time skip to (almost) the end of file
                    if (filePosition == 0) {
                        size_t fileSize = f.size ();
                        // move to 512 bytes before the end of the file
                        f.seek (fileSize > 512 ? fileSize - 512 : 0);
                        // move past next \n
                        while (f.available () && f.read () != '\n') {

                          diskTrafficInformation.bytesRead += 1; // update performance counter without semaphore - values may not be perfectly exact but we won't loose time this way

